tests/test-medium-load.yml
# Artillery Load Test Configuration: Medium Load
# Scenario: 500 concurrent users, 5000 total requests

config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 25
      name: "Warm up"
    - duration: 180
      arrivalRate: 50
      name: "Sustained medium load"
    - duration: 60
      arrivalRate: 25
      name: "Cool down"
  
scenarios:
  - name: "Get Products List"
    weight: 70
    flow:
      - get:
          url: "/api/products"
          capture:
            - json: "$.serviceId"
              as: "serviceId"
      - think: 1
  
  - name: "Get Product by ID"
    weight: 20
    flow:
      - get:
          url: "/api/products/{{ $randomNumber(1, 5) }}"
      - think: 1
  
  - name: "Get Products by Category"
    weight: 10
    flow:
      - get:
          url: "/api/products/category/Electronics"
      - think: 1